package 刘怡东0717;



public class 构造方法TEST {
public static void main(String[] args) {
	管理员 t=new 管理员("张三");
	学生上网 s=new 学生上网("李6",29,1);
	学生上网 s1=new 学生上网("李si",6,2);
	学生上网 s2=new 学生上网("李四",19,50);
	学生上网 s3=new 学生上网("李四",5,1);
	学生上网 s4=new 学生上网("李四",29,2);
	学生上网 s5=new 学生上网("李四",23,2);
	学生上网 s6=new 学生上网("李四",29,5);
	学生上网 s7=new 学生上网("李四",29,2);
	学生上网 s8=new 学生上网("李四",29,7);
	学生上网 s9=new 学生上网("李四",79,2);
	学生上网 s0=new 学生上网("李四",29,4);
	学生上网[] sts= {s,s1,s2,s3,s4,s5,s6,s7,s8,s9,s0};
	t.jiancha(sts);
	
	
	
	学生打饭 x=new 学生打饭("张三","男", 4);
	学生打饭 x1=new 学生打饭("李四","女", 2);
	学生打饭 x2=new 学生打饭("王五","男", 4);
	学生打饭[] xs= {x,x1,x2};
	食堂阿姨 y=new 食堂阿姨();
	y.feed(xs);
	
	
	全城热恋 q=new 全城热恋(21);
	全城热恋 q1=new 全城热恋(23);
	全城热恋 q2=new 全城热恋(75);
	全城热恋 q3=new 全城热恋(43);
	全城热恋 q4=new 全城热恋(18);
	全城热恋[] qs= {q,q1,q2,q3,q4};
	主持人 yanzi=new 主持人();
	yanzi.check(qs);
	
	
	敬老院老人 j=new 敬老院老人(70,"男","张三");
	敬老院老人 j1=new 敬老院老人(60,"女","李四");
	敬老院老人 j2=new 敬老院老人(68,"男","王五");
	敬老院老人 j3=new 敬老院老人(75,"女","赵六");
	敬老院老人[] js= {j,j1,j2,j3};
	敬老院 jl=new 敬老院();
	jl.money(js);
	
	学生点名 dm=new 学生点名("张三",17);
	学生点名 dm1=new 学生点名("张四",28);
	学生点名[] dms= {dm,dm1};
	老师点名 lm=new 老师点名();
	lm.check(dms);
	
	学生洗澡 xz=new 学生洗澡("男","张三");
	学生洗澡 xz1=new 学生洗澡("女","张四");
	学生洗澡 xz2=new 学生洗澡("女","张五");
	学生洗澡[] xzs= {xz,xz1,xz2};
	洗澡看门 km=new 洗澡看门();
	km.check(xzs);
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
}
}
